
// Mp3Dlg.cpp
//============================================================================//
// 概要：なし。
// 補足：なし。
//============================================================================//

#include "Mp3Dlg.h"
#include "..\resource.h"
#include "..\Profile.h"


/******************************************************************************/
//		コンストラクタおよびデストラクタ
/******************************************************************************/
// コンストラクタ
//============================================================================//
// 概要：なし。
// 補足：なし。
//============================================================================//

Mp3Dlg::Mp3Dlg() 
{
}


/******************************************************************************/
// デストラクタ
//============================================================================//
// 概要：なし。
// 補足：なし。
//============================================================================//

Mp3Dlg::~Mp3Dlg() 
{
}



/******************************************************************************/
//		メッセージハンドラ
/******************************************************************************/
// メッセージマップ
//============================================================================//
// 概要：なし。
// 補足：なし。
//============================================================================//

BEGIN_DLG_MESSAGE_MAP(Mp3DlgProc, Mp3Dlg)
	ON_MESSAGE( WM_INITDIALOG	, OnInitDialog)
	ON_MESSAGE( WM_CTLCOLORSTATIC	, OnCtlColorStatic)
	BEGIN_COMMAND_MAP()
		ON_COMMAND( IDC_USE_CUE		, OnChecked)
//		ON_COMMAND( IDCANCEL		, OnCancel)
	END_COMMAND_MAP()
END_DLG_MESSAGE_MAP()


/******************************************************************************/
// ダイアログ初期化
//============================================================================//
// 概要：なし。
// 補足：なし。
//============================================================================//

BOOL Mp3Dlg::OnInitDialog(HWND hDlg, WPARAM wParam, LPARAM lParam)
{
	CheckDlgButton(hDlg, IDC_USE_ID3V2, Profile::blnUseId3v2 ? BST_CHECKED : BST_UNCHECKED);
	CheckDlgButton(hDlg, IDC_USE_CUE,Profile::blnUseCue ? BST_CHECKED : BST_UNCHECKED);
	CheckDlgButton(hDlg, IDC_USE_MP3CUE, Profile::blnUseMp3Cue ? BST_CHECKED : BST_UNCHECKED);

	SetEnable();
	return FALSE;
}


/******************************************************************************/
// チェックされた
//============================================================================//
// 概要：なし。
// 補足：なし。
//============================================================================//

BOOL Mp3Dlg::OnChecked(HWND hDlg, WPARAM wParam, LPARAM lParam)
{
	SetEnable();
	return TRUE;
}


/******************************************************************************/
// 有効無効切り替え
//============================================================================//
// 概要：なし。
// 補足：なし。
//============================================================================//

void Mp3Dlg::SetEnable()
{
	EnableWindow(GetDlgItem(m_hWnd, IDC_USE_MP3CUE), IsDlgButtonChecked(m_hWnd, IDC_USE_CUE));
}


/******************************************************************************/
// 適用
//============================================================================//
// 概要：なし。
// 補足：なし。
//============================================================================//

void Mp3Dlg::DoApply()
{
	Profile::blnUseId3v2	= IsDlgButtonChecked(m_hWnd, IDC_USE_ID3V2);
	Profile::blnUseCue	= IsDlgButtonChecked(m_hWnd, IDC_USE_CUE);
	Profile::blnUseMp3Cue	= IsDlgButtonChecked(m_hWnd, IDC_USE_MP3CUE);
}