
// uRegistry.cpp
// レジストリラッパークラス
//============================================================================//
// 概要：なし。
// 補足：なし。
//============================================================================//

#include "uRegistry.h"


/******************************************************************************/
//		コンストラクタおよびデストラクタ
/******************************************************************************/
// コンストラクタ
//============================================================================//
// 概要：なし。
// 補足：なし。
//============================================================================//

Registry::Registry()
: hkey(NULL)
{
}


/******************************************************************************/
// デストラクタ
//============================================================================//
// 概要：なし。
// 補足：なし。
//============================================================================//

Registry::~Registry()
{
	Close();
}



/******************************************************************************/
//		レジストリ操作
/******************************************************************************/
// 開く
//============================================================================//
// 概要：なし。
// 補足：なし。
//============================================================================//

BOOL Registry::Open(HKEY hkeyRoot, PCTSTR pszSubKey, REGSAM sam)
{
	if(hkey)
	{
		return FALSE;
	}

	if(RegOpenKeyEx(hkeyRoot, pszSubKey, 0, sam, &hkey) != ERROR_SUCCESS)
	{
		hkey = NULL;
		return FALSE;
	}

	return TRUE;
}


/******************************************************************************/
// 閉じる
//============================================================================//
// 概要：なし。
// 補足：なし。
//============================================================================//

BOOL Registry::Close()
{
	if(!hkey)
	{
		return TRUE;
	}

	if(RegCloseKey(hkey) != ERROR_SUCCESS)
	{
		return FALSE;
	}

	hkey = NULL;
	return TRUE;
}


/******************************************************************************/
// キーの作成
//============================================================================//
// 概要：なし。
// 補足：なし。
//============================================================================//

BOOL Registry::Create(HKEY hkeyRoot, PCTSTR pszSubKey, REGSAM sam)
{
	HKEY hCreatedKey;

	if(RegCreateKeyEx(hkeyRoot, pszSubKey, 0, NULL, 0, sam, NULL, &hCreatedKey, NULL) != ERROR_SUCCESS)
	{
		return FALSE;
	}

	RegCloseKey(hCreatedKey);
	return TRUE;
}


/******************************************************************************/
// キーを削除する
//============================================================================//
// 概要：なし。
// 補足：なし。
//============================================================================//

BOOL Registry::Delete(HKEY hkeyRoot, PCTSTR pszSubKey)
{
	if(RegDeleteKey(hkeyRoot, pszSubKey) == ERROR_SUCCESS)
	{
		return TRUE;
	}

	return FALSE;
}



/******************************************************************************/
// 値を読みとり
//============================================================================//
// 概要：なし。
// 補足：なし。
//============================================================================//

BOOL Registry::Read(PCTSTR pszValueName, DWORD* pdwType, BYTE* pByte, DWORD* pdwSize)
{
	if(!hkey)
	{
		return FALSE;
	}

	if(RegQueryValueEx(hkey, pszValueName, 0, pdwType, pByte, pdwSize) != ERROR_SUCCESS)
	{
		return FALSE;
	}

	return TRUE;
}


/******************************************************************************/
// 書き込み
//============================================================================//
// 概要：なし。
// 補足：なし。
//============================================================================//

BOOL Registry::Write(PCTSTR pszValueName, DWORD dwType, const BYTE* pByte, DWORD dwSize)
{
	if(!hkey)
	{
		return FALSE;
	}

	if(RegSetValueEx(hkey, pszValueName, 0, dwType, pByte, dwSize) != ERROR_SUCCESS)
	{
		return FALSE;
	}

	return TRUE;
}


/******************************************************************************/
// 値を削除
//============================================================================//
// 概要：なし。
// 補足：なし。
//============================================================================//

BOOL Registry::Clear(PCTSTR pszValueName)
{
	if(!hkey)
	{
		return FALSE;
	}

	if(RegDeleteValue(hkey, pszValueName) == ERROR_SUCCESS)
	{
		return TRUE;
	}

	return FALSE;
}
